app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT * FROM "companies" WHERE (name LIKE '%%')

  def create
    @company = Company.new(params[:company])
    if @company.save
---
INSERT INTO "companies" ("name", "address1", "city", "address2", "zip", "updated_at", "country_id", "website", "phone", "state_id", "sector_id", "created_at") VALUES('Codigo Abierto', 'Calle Lucca 1257', 'Mexicali', 'Gran Venezia', '21353', '2010-08-17 22:55:19', NULL, 'http://codigo-abierto.net', '686-9465863', NULL, NULL, '2010-08-17 22:55:19')

  def edit
    @company = Company.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)

  def show
    @company = Company.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)

  def update
    @company = Company.find(params[:id])
    if @company.update_attributes(params[:company])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
UPDATE "companies" SET "sector_id" = 1, "state_id" = 24, "country_id" = 2, "updated_at" = '2010-08-20 04:49:58' WHERE "id" = 1

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
---
SELECT * FROM "companies" WHERE ("companies"."id" = 2)
DELETE FROM "companies" WHERE "id" = 2