app/controllers/countries_controller.rb

SELECT * FROM "countries" WHERE (name LIKE '%%')
---
  def index
    @countries = Country.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])

INSERT INTO "countries" ("name", "updated_at", "created_at") VALUES('México', '2010-08-17 19:50:38', '2010-08-17 19:50:38')
---
  def create
    @country = Country.new(params[:country])
    if @country.save

SELECT * FROM "countries" WHERE ("countries"."id" = 1)
---
  def show
    @country = Country.find(params[:id])

SELECT * FROM "countries" WHERE ("countries"."id" = 1)
---
  def edit
    @country = Country.find(params[:id])

SELECT * FROM "countries" WHERE ("countries"."id" = 1)
UPDATE "countries" SET "name" = 'México (mi pais)', "updated_at" = '2010-08-17 19:52:30' WHERE "id" = 1
---
  def update
    @country = Country.find(params[:id])
    if @country.update_attributes(params[:country])

SELECT * FROM "countries" WHERE ("countries"."id" = 3)
DELETE FROM "countries" WHERE "id" = 3
---
  def destroy
    @country = Country.find(params[:id])
    @country.destroy