app/controllers/departments_controller.rb

SELECT * FROM "departments" WHERE (name LIKE '%%')
---
  def index
    @departments = Department.all

INSERT INTO "departments" ("name", "updated_at", "created_at") VALUES('Contabilidad', '2010-08-17 20:21:27', '2010-08-17 20:21:27')
---
  def create
    @department = Department.new(params[:department])
    if @department.save

SELECT * FROM "departments" WHERE ("departments"."id" = 3)
---
  def edit
    @department = Department.find(params[:id])

SELECT * FROM "departments" WHERE ("departments"."id" = 0)
---
  def show
    @department = Department.find(params[:id])

SELECT * FROM "departments" WHERE ("departments"."id" = 3)
UPDATE "departments" SET "name" = 'Dirección', "updated_at" = '2010-08-17 20:21:55' WHERE "id" = 3
---
  def update
    @department = Department.find(params[:id])
    if @department.update_attributes(params[:department])

SELECT * FROM "departments" WHERE ("departments"."id" = 4)
DELETE FROM "departments" WHERE "id" = 4
---
  def destroy
    @department = Department.find(params[:id])
    @department.destroy