app/controllers/interests_controller.rb

  def index
    @interests = Interest.all
---
SELECT * FROM "interests"

  def create
    @interest = Interest.new(params[:interest])
    if @interest.save
---
INSERT INTO "interests" ("name", "updated_at", "created_at") VALUES('Conocer gente', '2010-08-17 20:09:29', '2010-08-17 20:09:29')

  def edit
    @interest = Interest.find(params[:id])
---
SELECT * FROM "interests" WHERE ("interests"."id" = 1)

  def update
    @interest = Interest.find(params[:id])
    if @interest.update_attributes(params[:interest])
---
SELECT * FROM "interests" WHERE ("interests"."id" = 1)
UPDATE "interests" SET "name" = 'Conocer proveedores para mi planta industrial', "updated_at" = '2010-08-17 20:09:40' WHERE "id" = 1

  def destroy
    @interest = Interest.find(params[:id])
    @interest.destroy
---
SELECT * FROM "interests" WHERE ("interests"."id" = 3)
DELETE FROM "interests" WHERE "id" = 3