app/controllers/labels_controller.rb

  def index
    @labels = Label.all
---
SELECT * FROM "labels" LIMIT 1

  def create
    @label = Label.new(params[:label])
    if @label.save
---
INSERT INTO "labels" ("name", "bottom", "left", "updated_at", "height", "width", "top", "right", "created_at") VALUES('Estandar', NULL, NULL, '2010-08-19 19:33:24', 200, 280, NULL, NULL, '2010-08-19 19:33:24')

  def edit
    @label = Label.find(params[:id])
---
SELECT * FROM "labels" WHERE ("labels"."id" = 1)

  def show
    @label = Label.find(params[:id])
---
SELECT * FROM "labels" WHERE ("labels"."id" = 1)

  def update
    @label = Label.find(params[:id])
    if @label.update_attributes(params[:label])
---
SELECT * FROM "labels" WHERE ("labels"."id" = 1)
UPDATE "labels" SET "left" = 10, "top" = 10, "right" = 10, "updated_at" = '2010-08-19 19:49:03', "bottom" = 10 WHERE "id" = 1