app/controllers/promos_controller.rb

  def index
    @promos = Promo.all
---
SELECT * FROM "promos"

  def create
    @promo = Promo.new(params[:promo])
    if @promo.save
---
INSERT INTO "promos" ("name", "updated_at", "created_at") VALUES('Internet / Email', '2010-08-17 20:31:48', '2010-08-17 20:31:48')

  def edit
    @promo = Promo.find(params[:id])
---
SELECT * FROM "promos" WHERE ("promos"."id" = 3)

  def update
    @promo = Promo.find(params[:id])
    if @promo.update_attributes(params[:promo])
---
SELECT * FROM "promos" WHERE ("promos"."id" = 3)
UPDATE "promos" SET "name" = 'Folletos / Posters / Espectaculares', "updated_at" = '2010-08-17 20:32:14' WHERE "id" = 3

  def destroy
    @promo = Promo.find(params[:id])
    @promo.destroy
---
SELECT * FROM "promos" WHERE ("promos"."id" = 4)
DELETE FROM "promos" WHERE "id" = 4