app/controllers/registrations_controller.rb

  def index
    @registrations = Registration.all
---
SELECT * FROM "registrations"

  def create
    @registration = Registration.new(params[:registration])
    if @registration.save
---
INSERT INTO "registrations" ("name", "updated_at", "created_at") VALUES('Expositor', '2010-08-17 20:37:46', '2010-08-17 20:37:46')

  def edit
    @registration = Registration.find(params[:id])
---
SELECT * FROM "registrations" WHERE ("registrations"."id" = 3)

  def update
    @registration = Registration.find(params[:id])
    if @registration.update_attributes(params[:registration])
---
SELECT * FROM "registrations" WHERE ("registrations"."id" = 3)
UPDATE "registrations" SET "name" = 'Panelista', "updated_at" = '2010-08-17 20:38:29' WHERE "id" = 3

  def destroy
    @registration = Registration.find(params[:id])
    @registration.destroy
---
SELECT * FROM "registrations" WHERE ("registrations"."id" = 3)
DELETE FROM "registrations" WHERE "id" = 3