app/controllers/sectors_controller.rb

SELECT * FROM "sectors" WHERE (name LIKE '%%')
---
  def index
    @sectors = Sector.all

INSERT INTO "sectors" ("name", "updated_at", "created_at") VALUES('Industria / Maquiladora', '2010-08-17 20:26:41', '2010-08-17 20:26:41')
---
  def create
    @sector = Sector.new(params[:sector])
    if @sector.save

SELECT * FROM "sectors" WHERE ("sectors"."id" = 1)
---
  def edit
    @sector = Sector.find(params[:id])

SELECT * FROM "sectors" WHERE ("sectors"."id" = 1)
UPDATE "sectors" SET "name" = 'Industria / Maquiladora / Nacional', "updated_at" = '2010-08-17 20:26:50' WHERE "id" = 1
---
  def update
    @sector = Sector.find(params[:id])
    if @sector.update_attributes(params[:sector])

SELECT * FROM "sectors" WHERE ("sectors"."id" = 3)
DELETE FROM "sectors" WHERE "id" = 3
---
  def destroy
    @sector = Sector.find(params[:id])
    @sector.destroy