app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT * FROM "states" WHERE (name LIKE '%%')

  def show
    @state = State.find(params[:id])
---
SELECT * FROM "states" WHERE ("states"."id" = 1)

  def create
    @state = State.new(params[:state])
    if @state.save
---
INSERT INTO "states" ("name", "updated_at", "created_at") VALUES('Baja California', '2010-08-17 19:16:28', '2010-08-17 19:16:28')

  def edit
    @state = State.find(params[:id])
---
SELECT * FROM "states" WHERE ("states"."id" = 3)

  def update
    @state = State.find(params[:id])
    if @state.update_attributes(params[:state])
---
SELECT * FROM "states" WHERE ("states"."id" = 3)
UPDATE "states" SET "name" = 'Sinaloa', "updated_at" = '2010-08-17 19:18:19' WHERE "id" = 3

  def destroy
    @state = State.find(params[:id])
    @state.destroy
---
SELECT * FROM "states" WHERE ("states"."id" = 3)
DELETE FROM "states" WHERE "id" = 3